const regList = {
    // 手机
    tel: /^(13[0-9]|14[5-9]|15[012356789]|166|17[0-8]|18[0-9]|19[8-9])[0-9]{8}$/,
    // 邮箱
    email: /^([A-Za-z0-9_\-\.\u4e00-\u9fa5])+\@([A-Za-z0-9_\-\.])+\.([A-Za-z]{2,8})$/,
    // 身份证
    id: /^[1-9]\d{5}(18|19|20)\d{2}((0[1-9])|(1[0-2]))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/,
    // 用户名 4到16位（字母，数字，下划线，减号）
    username: /^[a-zA-Z0-9_-]{4,16}$/,
    // 密码 以字母开头，长度在6~18之间，只能包含字母、数字和下划线
    password: /^[a-zA-Z]\w{5,17}$/,
    // 输入的金额
    money: /^(([0-9][0-9]*)|(([0]\.\d{1,2}|[0-9][0-9]*\.\d{1,2})))$/,
    // qq号码
    qq: /^[1-9][0-9]{4,10}$/,
    // 微信号
    wechat: /^[a-zA-Z]([-_a-zA-Z0-9]{5,19})+$/,
    // 特殊字母
    specialLetters: /["'<>%;)(&+]+-!！@#$~/,
    // 车牌号
    carNumber: /^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}[A-Z0-9]{4}[A-Z0-9挂学警港澳]{1}$/,
    // 包含中文
    hasChina: /[\u4E00-\u9FA5]/,
    // 护照
    passport: /^(P\d{7}|G\d{7,8}|TH\d{7,8}|S\d{7,8}|A\d{7,8}|L\d{7,8}|\d{9}|D\d+|1[4,5]\d{7})$/,
    // 固定电话
    fixedLine: /(\(\d{3,4}\)|\d{3,4}-|\s)?\d{8}/
};

export default regList;
